import ollama  
from sentence_transformers import SentenceTransformer
from db import create_documents_table, insert_document, query_postgresql, generate_response


model = SentenceTransformer("sentence-transformers/all-MiniLM-L12-v2")

sentences = [
    "หงุดหงิดง่าย ไม่สามารถควบคุมได้ อารมณ์รุนแรงมากผิดปกติ ควบคุมอารมณ์ไม่ได้ อาจเป็นอาการที่เสี่ยงต่อการเป็นโรคซึมเศร้าหรือโรคไบโพลาร์ได้ แนะนำว่าในกรณีนี้ควรไปพบจิตแพทย์ที่โรงพยาบาลเพื่อตรวจประเมินอาการเพิ่มเติมให้ทราบสาเหตุที่แน่ชัดก่อน เพื่อที่จะได้ให้การรักษาที่เหมาะสม",
    "เวียนหัว ปวดต้นคอลามไปไหล่ หลัง หนักหัว มีอาการอาเจียนด้วย ปวดตา อาการดังกล่าวน่าจะเกิดจากกล้ามเนื้อคอบ่าไหล่อักเสบเรื้อรัง หรือออฟฟิศซินโดรม การรักษาจะเป็นการทานยาแก้อักเสบและยาคลายกล้ามเนื้อ เช่น ibuprofen, tolperisone ร่วมกับการยืดกล้ามเนื้อและทำกายภาพบำบัดครับ ถ้าอาการเป็นมากไม่รู้จะเริ่มรักษาอย่างไร หมอแนะนำลองปรึกษาหมอเวชศาสตร์ฟื้นฟูที่โณงพยาบาลหรือคลินิกเพิ่มเติมครับ",
    "รู้สึกทุกคนไม่รัก เศร้าตลอด รู้สึกไม่มีใครอยู่ข้างๆ ร้องไห้ง่าย กลัวการไปเจอหมอ กลัวไปหมด สิ้นหวังทุกอย่าง ท้อทุกอย่าง รู้สึกทำอะไรก็ไม่ถูกใจคนอื่น มีแต่คนพูดทำร้ายความรู้สึก กระสับกระส่ายบางที แนะนำให้การไปพบจิตแพทย์ไม่ได้เป็นเรื่องยากหรือน่ากลัวครับ จิตแพทย์พร้อมที่จะเป็นผู้ฟังที่ดี ที่จะรับฟังอย่างเข้าใจ และช่วยจะช่วยให้คำปรึกษาที่จะนำไปสู่การมีสุขภาพจิตที่ดีขึ้นครับ",
    "เจ็บภายในคอเวลากลืนน้ำลายยังรู้สึกถึงเจ็บและมีก้อนอะไรสักอย่าง ไม่สบายคอ และที่โคนลิ้นส่องดูมีก้อนขึ้น 1 ก้อนเกือบเท่าเม็ดถั่วแดง มีปวดหู อาการของคนไข้น่าจะเกิดจากต่อมทอนซิลอักเสบครับ โดยทั่วไปมักเกิดจากเชื้อไสรัส สามารถหายเองได้ใน 5-7 วัน หากเจ็บคอเยอะกลืนเจ็บ อาจพิจารณาทานยาแก้อักเสบ เช่น ibuprofen เพื่อลดอาการครับ"
]

create_documents_table()

# สร้าง + บันทึก embedding 
for doc in sentences:
    embedding = model.encode(doc).tolist()
    # print("Embedding length:", len(embedding))
    # print("Inserting:", doc[:30])  
    insert_document(doc, embedding)


# results = query_postgresql("หงุดหงิดง่าย")
# print(results)

# message = generate_response("หงุดหงิดง่าย")
# print("Returned value from generate_response:", message)

